#!/usr/bin/env python3

'''
Определите функцию good, которая возвращает список ['Harry', 'Ron', 'Hermione'].
'''

def good():
    return ['Harry', 'Ron', 'Hermione']

print(good())
